In [1]:
import sqlite3

In [3]:
connection=sqlite3.connect('example.db')
connection

In [4]:
cursor=connection.cursor()

In [6]:
# create a table

cursor.execute('''
Create Table If Not Exists employees(
               id Integer Primary Key,
               name Text Not Null,
               age Integer,
               department Text
               )
''')


# commit the changes 
connection.commit()

In [8]:
cursor.execute('''
Select * from employees
''')

In [11]:
# insert the data in sqllite table
cursor.execute('''
Insert into employees(name,age,department)
               Values('Divyansh',20,'All')
''')

cursor.execute('''
Insert into employees(name,age,department)
               Values('Singhal',21,'ll')
''')

cursor.execute('''
Insert into employees(name,age,department)
               Values('Mishu',22,'Al')
''')


## commit

connection.commit()

In [15]:
# query the data from the table

cursor.execute('Select * from employees')
rows = cursor.fetchall()




for i in rows:
    print (i)

(1, 'Divyansh', 20, 'All')
(2, 'Divyansh', 20, 'All')
(3, 'Singhal', 21, 'll')
(4, 'Mishu', 22, 'Al')
(5, 'Divyansh', 20, 'All')
(6, 'Singhal', 21, 'll')
(7, 'Mishu', 22, 'Al')

In [16]:
# update the data in the table

cursor.execute('''
Update employees
Set age=34
Where name='Divyansh'
''')
connection.commit()

In [18]:
cursor.execute('Select * from employees')
rows = cursor.fetchall()




for i in rows:
    print (i)

(1, 'Divyansh', 34, 'All')
(2, 'Divyansh', 34, 'All')
(3, 'Singhal', 21, 'll')
(4, 'Mishu', 22, 'Al')
(5, 'Divyansh', 34, 'All')
(6, 'Singhal', 21, 'll')
(7, 'Mishu', 22, 'Al')

In [20]:
# delete the data from table

cursor.execute('''
Delete from employees
               WHERE name = 'Divyansh'
''')
connection.commit()

In [22]:
cursor.execute('Select * from employees')
rows = cursor.fetchall()




for i in rows:
    print (i)

(3, 'Singhal', 21, 'll')
(4, 'Mishu', 22, 'Al')
(6, 'Singhal', 21, 'll')
(7, 'Mishu', 22, 'Al')

In [23]:
## Working Wwith Sales Data
# Connect to an SQLite database
connection = sqlite3.connect('sales_data.db')
cursor = connection.cursor()

# Create a table for sales data
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales (
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales INTEGER,
    region TEXT
)
''')

# Insert data into the sales table
sales_data = [
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product1', 150, 'East'),
    ('2023-01-04', 'Product3', 250, 'West'),
    ('2023-01-05', 'Product2', 300, 'North')
]

cursor.executemany('''
Insert into sales(date,product,sales,region)
                   values(?,?,?,?)
''',sales_data)

connection.commit()

In [24]:
cursor.execute('Select * from sales')
rows = cursor.fetchall()




for i in rows:
    print (i)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')

In [25]:
# close the connection
connection.close()